taskt/Core/Automation/Commands/DataTableGroup/IDataTableColumnPositionProperties_[%reverse%].puml
@startuml
package "taskt.Core.Automation.Commands"{
Interface "IDataTableColumnProperties" {
}
}

package "taskt.Core.Automation.Commands"{
Interface "IDataTableColumnPositionProperties" {
+{abstract} v_ColumnType : String <<get>> <<set>> <<abstract>> 
+{abstract} v_ColumnIndex : String <<get>> <<set>> <<abstract>> 
}
}

package "taskt.Core.Automation.Commands"{
Interface "IDataTableColumnRowPositionProperties" {
}
}

package "taskt.Core.Automation.Commands"{
class "FilterDataTableRowByColumnValueCommand" <<sealed>> {
+RunCommand() : void 
-cmbTargetType_SelectionChangeCommited() : void 
-cmbFilterAction_SelectionChangeCommited() : void 
+AfterShown() : void 
+BeforeValidate() : void 
+v_TargetDataTable : String <<get>> <<set>> 
+v_ColumnType : String <<get>> <<set>> 
+v_ColumnIndex : String <<get>> <<set>> 
+v_ValueType : String <<get>> <<set>> 
+v_FilterAction : String <<get>> <<set>> 
+v_FilterActionParameterTable : DataTable <<get>> <<set>> 
}
}

package "taskt.Core.Automation.Commands"{
abstract class "ADataTableColumnCommands"{
+v_ColumnType : String <<get>> <<set>> 
+v_ColumnIndex : String <<get>> <<set>> 
}
}

package "taskt.Core.Automation.Commands"{
abstract class "ADataTableColumnRowCommands"{
+v_ColumnType : String <<get>> <<set>> 
+v_ColumnIndex : String <<get>> <<set>> 
+v_RowIndex : String <<get>> <<set>> 
}
}

package "taskt.Core.Automation.Commands"{
abstract class "ADataTableBothColumnCommands"{
+v_DataTable : String <<get>> <<set>> 
}
}

package "taskt.Core.Automation.Commands"{
abstract class "ADataTableGetFromDataTableColumnCommands"{
+{abstract} v_Result : String <<get>> <<set>> <<abstract>> 
}
}

package "taskt.Core.Automation.Commands"{
class "ExportDataTableColumnAsTextFileCommand" <<sealed>> {
+RunCommand() : void 
+v_FilePath : String <<get>> <<set>> 
+v_ExportHeader : String <<get>> <<set>> 
+v_ExportIndex : String <<get>> <<set>> 
}
}

package "taskt.Core.Automation.Commands"{
class "ReplaceDataTableColumnValueCommand" <<sealed>> {
+RunCommand() : void 
-cmbTargetType_SelectionChangeCommited() : void 
-cmbReplaceAction_SelectionChangeCommited() : void 
+AfterShown() : void 
+BeforeValidate() : void 
+v_ValueType : String <<get>> <<set>> 
+v_ReplaceAction : String <<get>> <<set>> 
+v_ReplaceActionParameterTable : DataTable <<get>> <<set>> 
+v_NewValue : String <<get>> <<set>> 
}
}

package "taskt.Core.Automation.Commands"{
class "DeleteDataTableColumnCommand" <<sealed>> {
+RunCommand() : void 
}
}

package "taskt.Core.Automation.Commands"{
class "SetDataTableValueCommand" <<sealed>> {
+RunCommand() : void 
+v_NewValue : String <<get>> <<set>> 
}
}

package "taskt.Core.Automation.Commands"{
class "GetDataTableValueCommand" <<sealed>> {
+RunCommand() : void 
+v_Result : String <<get>> <<set>> 
}
}

package "taskt.Core.Automation.Commands"{
class "SetDataTableColumnValuesByDataTableCommand" <<sealed>> {
+RunCommand() : void 
+v_DataTable : String <<get>> <<set>> 
+v_SetDataTableName : String <<get>> <<set>> 
+v_IfRowNotEnough : String <<get>> <<set>> 
+v_IfSetDataTableNotEnough : String <<get>> <<set>> 
}
}

package "taskt.Core.Automation.Commands"{
class "SetDataTableColumnValuesByListCommand" <<sealed>> {
+RunCommand() : void 
+v_SetListName : String <<get>> <<set>> 
+v_IfRowNotEnough : String <<get>> <<set>> 
+v_IfListNotEnough : String <<get>> <<set>> 
}
}

package "taskt.Core.Automation.Commands"{
class "JoinDataTableColumnAsTextCommand" <<sealed>> {
+RunCommand() : void 
+v_Separator : String <<get>> <<set>> 
+v_Result : String <<get>> <<set>> 
+v_BeforeText : String <<get>> <<set>> 
+v_AfterText : String <<get>> <<set>> 
}
}

package "taskt.Core.Automation.Commands"{
class "ConvertDataTableColumnToTextCommand" <<sealed>> {
+RunCommand() : void 
+v_Result : String <<get>> <<set>> 
+v_ExportHeader : String <<get>> <<set>> 
+v_ExportIndex : String <<get>> <<set>> 
}
}

package "taskt.Core.Automation.Commands"{
class "ConvertDataTableColumnToJSONCommand" <<sealed>> {
+RunCommand() : void 
+v_Result : String <<get>> <<set>> 
}
}

package "taskt.Core.Automation.Commands"{
class "ConvertDataTableColumnToDictionaryCommand" <<sealed>> {
+RunCommand() : void 
+v_KeyPrefix : String <<get>> <<set>> 
+v_Result : String <<get>> <<set>> 
}
}

package "taskt.Core.Automation.Commands"{
class "ConvertDataTableColumnToDataTableCommand" <<sealed>> {
+RunCommand() : void 
+v_Result : String <<get>> <<set>> 
}
}

package "taskt.Core.Automation.Commands"{
class "ConvertDataTableColumnToListCommand" <<sealed>> {
+RunCommand() : void 
+v_Result : String <<get>> <<set>> 
}
}

package "taskt.Core.Automation.Commands"{
class "CheckDataTableColumnExistsCommand" <<sealed>> {
+RunCommand() : void 
+v_Result : String <<get>> <<set>> 
}
}


taskt.Core.Automation.Commands.IDataTableColumnPositionProperties <|-- taskt.Core.Automation.Commands.IDataTableColumnProperties
taskt.Core.Automation.Commands.IDataTableColumnPositionProperties <|-- taskt.Core.Automation.Commands.IDataTableColumnRowPositionProperties
taskt.Core.Automation.Commands.IDataTableColumnPositionProperties <|.. taskt.Core.Automation.Commands.FilterDataTableRowByColumnValueCommand
taskt.Core.Automation.Commands.IDataTableColumnProperties <|.. taskt.Core.Automation.Commands.ADataTableColumnCommands
taskt.Core.Automation.Commands.IDataTableColumnRowPositionProperties <|.. taskt.Core.Automation.Commands.ADataTableColumnRowCommands
taskt.Core.Automation.Commands.ADataTableColumnCommands <|-- taskt.Core.Automation.Commands.ADataTableBothColumnCommands
taskt.Core.Automation.Commands.ADataTableColumnCommands <|-- taskt.Core.Automation.Commands.ADataTableGetFromDataTableColumnCommands
taskt.Core.Automation.Commands.ADataTableColumnCommands <|-- taskt.Core.Automation.Commands.ExportDataTableColumnAsTextFileCommand
taskt.Core.Automation.Commands.ADataTableColumnCommands <|-- taskt.Core.Automation.Commands.ReplaceDataTableColumnValueCommand
taskt.Core.Automation.Commands.ADataTableColumnCommands <|-- taskt.Core.Automation.Commands.DeleteDataTableColumnCommand
taskt.Core.Automation.Commands.ADataTableColumnRowCommands <|-- taskt.Core.Automation.Commands.SetDataTableValueCommand
taskt.Core.Automation.Commands.ADataTableColumnRowCommands <|-- taskt.Core.Automation.Commands.GetDataTableValueCommand
taskt.Core.Automation.Commands.ADataTableBothColumnCommands <|-- taskt.Core.Automation.Commands.SetDataTableColumnValuesByDataTableCommand
taskt.Core.Automation.Commands.ADataTableBothColumnCommands <|-- taskt.Core.Automation.Commands.SetDataTableColumnValuesByListCommand
taskt.Core.Automation.Commands.ADataTableGetFromDataTableColumnCommands <|-- taskt.Core.Automation.Commands.JoinDataTableColumnAsTextCommand
taskt.Core.Automation.Commands.ADataTableGetFromDataTableColumnCommands <|-- taskt.Core.Automation.Commands.ConvertDataTableColumnToTextCommand
taskt.Core.Automation.Commands.ADataTableGetFromDataTableColumnCommands <|-- taskt.Core.Automation.Commands.ConvertDataTableColumnToJSONCommand
taskt.Core.Automation.Commands.ADataTableGetFromDataTableColumnCommands <|-- taskt.Core.Automation.Commands.ConvertDataTableColumnToDictionaryCommand
taskt.Core.Automation.Commands.ADataTableGetFromDataTableColumnCommands <|-- taskt.Core.Automation.Commands.ConvertDataTableColumnToDataTableCommand
taskt.Core.Automation.Commands.ADataTableGetFromDataTableColumnCommands <|-- taskt.Core.Automation.Commands.ConvertDataTableColumnToListCommand
taskt.Core.Automation.Commands.ADataTableGetFromDataTableColumnCommands <|-- taskt.Core.Automation.Commands.CheckDataTableColumnExistsCommand
@enduml
